<template>
  <div class="wrapper">
    <div class="pdfDom">
      111111111111111这是一个 数据1 这是一个 数据1
      <p>111111111111111这是一个 数据1 这是一个 数据1</p>
      <p>111111111111111这是一个 数据1 这是一个 数据1</p>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
      <h1>111111111111111这是一个 数据1 这是一个 数据1</h1>
    </div>
    <div class="pdfDom">22222222222222这是一个 数据2 这是一个 数据3</div>
    <div class="pdfDom">333333333333333这是一个 数据2 这是一个 数据4</div>
    <div class="pdfDom">444444444444444444这是一个 数据2 这是一个 数据5</div>
    <van-button type="info" @click="transform">PDF按钮</van-button>
  </div>
</template>
<script>
export default {
  name: "DownloadPDFZip",
  data() {
    return {};
  },
  methods: {
    transform() {
      this.html2pdf(".pdfDom", `个人报告`);
    },
  },
};
</script>
<style>
.wrapper {
  padding-bottom: 50px;
}
h1 {
  font-size: 36px;
}
</style>
